app/views/authors/show.html.erb


<% @author.posts.each do |post| %>
---
SELECT "posts".* FROM "posts"  WHERE "posts"."author_id" = $1  [["author_id", 1]]