app/views/tags/index.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "posts_tags" ON "posts"."id" = "posts_tags"."post_id" WHERE "posts_tags"."tag_id" = $1  [["tag_id", 1]]
---

			<% @map = tag.posts.map do |post| %>