app/views/posts/_post_form.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = $1  [["post_id", 1]]
---
			<% @tags.each do |tag|%>
				<input  type="checkbox" name="tags[]" value="<%= tag.id %>" <% @post.tags.each do |tag2|%>