app/views/posts/index.html.erb

			<p>
				<% post.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = $1  [["post_id", 1]]