app/controllers/authors_controller.rb

	def create
		@author = Author.new(author_params)
		if @author.valid?
			@author.save
---
INSERT INTO "authors" ("bio", "created_at", "img_url", "location", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"