app/controllers/posts_controller.rb

	def edit
		@post = Post.find(params[:id])
		@authors = Author.all
---
SELECT "authors".* FROM "authors"