app/controllers/posts_controller.rb

SELECT "authors".* FROM "authors"
---
	def new
		@post = Post.new
		@authors = Author.all

SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "posts" ("author_id", "created_at", "title", "updated_at", "words") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["created_at", "2014-11-29 14:51:18.962516"], ["title", "Happy"], ["updated_at", "2014-11-29 14:51:18.962516"], ["words", "Nate Salsbury, Salsbury Troubadours, Chicago"]]
SELECT "tags".* FROM "tags"
---
	def create
		post = Post.new(post_params)
		tags = Tag.find(params[:tags])

		tags.each {|tag| post.tags << tag }

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "tags".* FROM "tags"
---
	def edit
		@post = Post.find(params[:id])
		@tags = Tag.all

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = $1  [["post_id", 1]]
UPDATE "posts" SET "img_url" = $1, "updated_at" = $2, "words" = $3 WHERE "posts"."id" = 4  [["img_url", "https://s-media-cache-ak0.pinimg.com/736x/79/98/b2/7998b2fb3df0920e55b8b02c6e1c0f6d.jpg"], ["updated_at", "2014-12-01 02:18:43.416113"], ["words", "Audrey Hepburn"]]
---
	def update
		updatedpost = Post.find(params[:id])
		tags = Tag.find(params[:tags])
		updatedpost.tags = []
		tags.each {|tag| updatedpost.tags << tag }

		if updatedpost.update(post_params)