app/controllers/sessions_controller.rb

	def create
		author = Author.find_by(username: params[:username])
---
SELECT  "authors".* FROM "authors"  WHERE "authors"."username" = 'CoolDog' LIMIT 1