app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"
SELECT "posts".* FROM "posts"
---
	def index
		@tags = Tag.all
		@posts = Post.all

SELECT "posts".* FROM "posts"
SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@posts = Post.all
		@tag = Tag.find(params[:id])

INSERT INTO "tags" ("name") VALUES ($1) RETURNING "id"  [["name", "fairy tale"]]
---
	def create
		tag = Tag.new(tag_params)
		if tag.valid?
			tag.save